/* Информация для карточек зданий */ 
const Data = [
    {
        mainImage: require('../../images/infoImages/guestdvor.jpg'), 
        buildingName: 'Гостиный двор', 
        date: '1791 - 1796 гг.', 
        icon: require('../../images/icons/sweet.png'), 
        description: 'Это двухэтажное с подвалами здание выполнено в стиле раннего классицизма. По внешнему и внутреннему периметру оно обрамлено галереей-аркадой, которая в конце XIX в. внутри двора была почти полностью застроена. Первоначально на углах здания имелись проходы для пешеходов, позднее заложенные. Внутри здания каждой арке соответствует секция купеческой лавки.'
    },
    {
        mainImage: require('../../images/infoImages/bigmuch.jpg'), 
        buildingName: 'Большие мучные ряды', 
        date: '1789 — конец 1790-х гг.', 
        icon: require('../../images/icons/muka.png'), 
        description: `Построено на средства костромских купцов вместо прежних деревянных лавок для оптовой и розничной торговли различной мукой, сгоревших в пожар 1773 г. В середине XIX в. (1850е) с юго-восточной стороны, со двора, сделаны дополнительные пристройки.
        У Больших Мучных рядов есть несколько отличий: торговые лавки у них вдвое больше, чем у Гостиного двора; перекрытие галерей не сводчатое, а плоское.`
    },
    {
        mainImage: require('../../images/infoImages/bread.jpeg'), 
        buildingName: 'Хлебные ряды', 
        date: 'Кон. 1800-х — нач. 1810-х гг.', 
        icon: require('../../images/icons/bread.png'), 
        description: `Интересный пример торгового здания Костромы в стиле классицизма, частично перестроенного в духе эклектики. В 1805 г. на его месте еще значилось «градская впусте лежащая земля», а на «Части плана города Костромы» нач. XIX в. (до 1819 г.) здание уже показано выстроенным.`
    },
    {
        mainImage: require('../../images/infoImages/pryanichnye.jpg'),
        buildingName: 'Пряничные ряды', 
        date: 'Конец XVIII - начало XIX века',  
        icon: require('../../images/icons/krendel.png'),
        description: 'Построены в стиле классицизма. Они сооружены на средства местных купцов на рубеже XVIII-XIX вв. (1800е) Кирпичный корпус расположен между Гостиным двором и Рыбными рядами. Внутреннюю структуру определяют поперечные капитальные стены, которые делят пространство на одинаковые ячейки – лавки.'
    }
]

export default Data