/* Информация для элементов таймлайна */ 
const allInfo = [
    {
        img: require("../images/timeline/Спаса_1.png"),
        date: '1766',
        text: 'Церковь Спаса на средства костромского купца С.С.Белова'
    },
    {
        img: require("../images/timeline/Большие_мучные.png"),
        date: '1789 - 1790',
        text: 'Большие Мучные ряды - построены на месте сгоревших лавок в 1773 г.'
    },
    {
        img: require("../images/timeline/Городская_дума_глав.png"),
        date: '1790-е',
        text: 'Ансамбль городской думы и магистрата -  изначально построено как жилой дом купца Солодовникова'
    },
    {
        img: require("../images/timeline/Гостиный_двор.png"),
        date: '1791 - 1796',
        text: 'Строительство Дворовой галереи гостиного двора у церкви под руководством зодчих С.А. Воротилова и И.Гове'
    },
    {
        img: require("../images/timeline/Квасные_ряды.png"),
        date: '1801',
        text: 'Квасные ряды построены по заказу костромских купцов и мещан в стиле зрелого классицизма'
    },
        {
        img: require("../images/timeline/Пряничные_ряды2.png"),
        date: '1800-е',
        text: 'Пряничные ряды построены в стиле классицизма. Они сооружены на средства местных купцов'
    },
        {
        img: require("../images/timeline/Лавка_Калашная.png"),
        date: '1800-е',
        text: 'Построена Калашная лавка - сооружение начала XIX в. торгового комплекса в стиле классицизма'
    },
        {
        img: require("../images/timeline/Масляные_ряды_первая_половина.png"),
        date: '1810-е',
        text: 'Масляные ряды - построены на месте прежних лавок для торговли маслом, дегтем и прочими товарами.'
    },
        {
        img: require("../images/timeline/Хлебные_ряды.png"),
        date: '1810-е',
        text: 'Построено торговое здание Костромы в стиле классицизма, частично перестроенного в духе эклектики - Хлебные ряды'
    },
        {
        img: require("../images/timeline/Овощные_ряды.png"),
        date: '1819 - 1824',
        text: 'Строение первой четверти XIX в. в стиле позднего классицизма - Овощные ряды'
    },
    {
        img: null,
        date: '1820-е',
        text: 'К дворовой галерее Гостиного двора сделаны пристройки Рукавичного и Холщового рядов'
    },
    {
        img: require("../images/timeline/Дегтярные.png"),
        date: '1820 - 1830-е',
        text: 'Дегтярные ряды выстроены в стиле классицизма, были переделаны в формах архитектуры эклектики'
    },
    {
        img: require("../images/timeline/Соляной_магазин.png"),
        date: '1820 - 1830-е',
        text: 'Построен Соляной магазин, также называемый Соляной склад'
    },
    {
        img: require("../images/timeline/Рыбные_ряды.png"),
        date: '1823',
        text: 'Построены Рыбные ряды - здание Костромы в стиле позднего классицизма, играющее важную роль в торговом центре города'
    },
    {
        img: require("../images/timeline/Мелочные_ряды.png"),
        date: '1830 - 1832',
        text: 'Внутри Гостиного двора (по проекту губернского архитектора П.И.Фурсова) возведены четыре каменных корпуса Мелочных рядов'
    },
    {
        img: require("../images/timeline/Малые_мучные.png"),
        date: '1840-е',
        text: 'Малые мучные ряды - поетроены (возможно после пожара 1847 г.) в стиле позднего классицизма'
    },
    {
        img: require("../images/timeline/Часовня.png"),
        date: '1840 - 1850',
        text: 'Построена Часовня - культовая постройка в стиле позднего классицизма, одна из немногих сохранившихся ныне в центре города часовен'
    },
    {
        img: require("../images/timeline/Лавка_церкви_Иоана_север.png"),
        date: '1850-е',
        text: 'Построены Лавки церкви Иоанна Предтечи'
    },
    {
        img: require("../images/timeline/Чайная_наши_дни.png"),
        date: '1890-е',
        text: 'Чайная и коммерческая биржа - построена для чайной Общества трезвости и коммерческой биржи и в народе получило название "Колпаки"'
    },
]

export default allInfo
