const allInfo = 
    [
        {
            img: require("../../src/images/Спаса_1.png"),
            date: '1766',
            text: 'Церковь Спаса на средства костромского купца С.С.Белова'
        },
        {
            img: null,
            date: '1791',
            text: 'Начало строительства дворовой галереи гостинного двора у церкви под руководством зодчего С.А.Воротилова'
        },
        {
            img: null,
            date: '1796',
            text: 'Завершение строительства под руководством губернского архитектора И.Гове'
        },
        {
            img: null,
            date: '1820-е',
            text: 'К дворовой галерее Гостинного двора сделаны пристройки Рукавичного и Холщового рядов'
        },
    ]

export default allInfo